RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_adc12_regs.h
/*
 * CAL_OUT (RW)
 *
 */
#define ADC12_ANA_STATUS_CAL_OUT_MASK (0x7FU)
#define ADC12_ANA_STATUS_CAL_OUT_SHIFT (0U)
#define ADC12_ANA_STATUS_CAL_OUT_SET(x) (((uint32_t)(x) << ADC12_ANA_STATUS_CAL_OUT_SHIFT) & ADC12_ANA_STATUS_CAL_OUT_MASK)
#define ADC12_ANA_STATUS_CAL_OUT_GET(x) (((uint32_t)(x) & ADC12_ANA_STATUS_CAL_OUT_MASK) >> ADC12_ANA_STATUS_CAL_OUT_SHIFT)



/* CONFIG register group index macro definition */
#define ADC12_CONFIG_TRG0A (0UL)
#define ADC12_CONFIG_TRG0B (1UL)
#define ADC12_CONFIG_TRG0C (2UL)
#define ADC12_CONFIG_TRG1A (3UL)
#define ADC12_CONFIG_TRG1B (4UL)
#define ADC12_CONFIG_TRG1C (5UL)
#define ADC12_CONFIG_TRG2A (6UL)
#define ADC12_CONFIG_TRG2B (7UL)
#define ADC12_CONFIG_TRG2C (8UL)
#define ADC12_CONFIG_TRG3A (9UL)
#define ADC12_CONFIG_TRG3B (10UL)
#define ADC12_CONFIG_TRG3C (11UL)

/* BUS_RESULT register group index macro definition */
#define ADC12_BUS_RESULT_CHN0 (0UL)
#define ADC12_BUS_RESULT_CHN1 (1UL)
#define ADC12_BUS_RESULT_CHN2 (2UL)
#define ADC12_BUS_RESULT_CHN3 (3UL)
#define ADC12_BUS_RESULT_CHN4 (4UL)
#define ADC12_BUS_RESULT_CHN5 (5UL)
#define ADC12_BUS_RESULT_CHN6 (6UL)
#define ADC12_BUS_RESULT_CHN7 (7UL)
#define ADC12_BUS_RESULT_CHN8 (8UL)
#define ADC12_BUS_RESULT_CHN9 (9UL)
#define ADC12_BUS_RESULT_CHN10 (10UL)
#define ADC12_BUS_RESULT_CHN11 (11UL)
#define ADC12_BUS_RESULT_CHN12 (12UL)
#define ADC12_BUS_RESULT_CHN13 (13UL)
#define ADC12_BUS_RESULT_CHN14 (14UL)
#define ADC12_BUS_RESULT_CHN15 (15UL)
#define ADC12_BUS_RESULT_CHN16 (16UL)
#define ADC12_BUS_RESULT_CHN17 (17UL)
#define ADC12_BUS_RESULT_CHN18 (18UL)

/* SEQ_QUE register group index macro definition */
#define ADC12_SEQ_QUE_CFG0 (0UL)
#define ADC12_SEQ_QUE_CFG1 (1UL)
#define ADC12_SEQ_QUE_CFG2 (2UL)
#define ADC12_SEQ_QUE_CFG3 (3UL)
#define ADC12_SEQ_QUE_CFG4 (4UL)
#define ADC12_SEQ_QUE_CFG5 (5UL)
#define ADC12_SEQ_QUE_CFG6 (6UL)
#define ADC12_SEQ_QUE_CFG7 (7UL)
#define ADC12_SEQ_QUE_CFG8 (8UL)
#define ADC12_SEQ_QUE_CFG9 (9UL)
#define ADC12_SEQ_QUE_CFG10 (10UL)
#define ADC12_SEQ_QUE_CFG11 (11UL)
#define ADC12_SEQ_QUE_CFG12 (12UL)
#define ADC12_SEQ_QUE_CFG13 (13UL)
#define ADC12_SEQ_QUE_CFG14 (14UL)
#define ADC12_SEQ_QUE_CFG15 (15UL)

/* PRD_CFG register group index macro definition */
#define ADC12_PRD_CFG_CHN0 (0UL)
#define ADC12_PRD_CFG_CHN1 (1UL)
#define ADC12_PRD_CFG_CHN2 (2UL)
#define ADC12_PRD_CFG_CHN3 (3UL)
#define ADC12_PRD_CFG_CHN4 (4UL)
#define ADC12_PRD_CFG_CHN5 (5UL)
#define ADC12_PRD_CFG_CHN6 (6UL)
#define ADC12_PRD_CFG_CHN7 (7UL)
#define ADC12_PRD_CFG_CHN8 (8UL)
#define ADC12_PRD_CFG_CHN9 (9UL)
#define ADC12_PRD_CFG_CHN10 (10UL)
#define ADC12_PRD_CFG_CHN11 (11UL)
#define ADC12_PRD_CFG_CHN12 (12UL)
#define ADC12_PRD_CFG_CHN13 (13UL)
#define ADC12_PRD_CFG_CHN14 (14UL)
#define ADC12_PRD_CFG_CHN15 (15UL)
#define ADC12_PRD_CFG_CHN16 (16UL)
#define ADC12_PRD_CFG_CHN17 (17UL)
#define ADC12_PRD_CFG_CHN18 (18UL)

/* SAMPLE_CFG register group index macro definition */
#define ADC12_SAMPLE_CFG_CHN0 (0UL)
#define ADC12_SAMPLE_CFG_CHN1 (1UL)
#define ADC12_SAMPLE_CFG_CHN2 (2UL)
#define ADC12_SAMPLE_CFG_CHN3 (3UL)
#define ADC12_SAMPLE_CFG_CHN4 (4UL)
#define ADC12_SAMPLE_CFG_CHN5 (5UL)
#define ADC12_SAMPLE_CFG_CHN6 (6UL)
#define ADC12_SAMPLE_CFG_CHN7 (7UL)
#define ADC12_SAMPLE_CFG_CHN8 (8UL)
#define ADC12_SAMPLE_CFG_CHN9 (9UL)
#define ADC12_SAMPLE_CFG_CHN10 (10UL)
#define ADC12_SAMPLE_CFG_CHN11 (11UL)
#define ADC12_SAMPLE_CFG_CHN12 (12UL)
#define ADC12_SAMPLE_CFG_CHN13 (13UL)
#define ADC12_SAMPLE_CFG_CHN14 (14UL)
#define ADC12_SAMPLE_CFG_CHN15 (15UL)
#define ADC12_SAMPLE_CFG_CHN16 (16UL)
#define ADC12_SAMPLE_CFG_CHN17 (17UL)
#define ADC12_SAMPLE_CFG_CHN18 (18UL)


#endif /* HPM_ADC12_H */
